import jieba
excludes = {'却说','⼆⼈','不可','主公','陛下','汉中','只⻅','众将','后主','蜀兵','上⻢','⼤叫','太守','此⼈','夫⼈',
 '先主','后⼈','背后','城中','天⼦','⼀⾯','何不','⼤军','忽报','先⽣','百姓','何故','不能','如此','如何',
 '然后','先锋','不如','赶来','原来','令⼈','江东','下⻢','喊声','正是','徐州','忽然','荆州','左右','军⻢',
 '因此','成都','不⻅','未知','⼤败','⼤事','之后','⼀军','引军','起兵','军中','接应','引兵','次⽇','⼤喜',
 '进兵','⼤惊','可以','以为','⼤怒','不得','⼼中','下⽂','⼀声','追赶','粮草','天下','东吴','于是','都督',
 '曹兵','⼀齐','分解','回报','分付','只得','出⻢','三千','⼤将','许都','随后','报知','今⽇','不敢','魏兵',
 '前⾯','之兵','且说','众官','洛阳','领兵','商议','军⼠','星夜','精兵','城上','之计','不肯','相⻅','其⾔',
 '⼀⽇','⽽⾏','⽂武','襄阳','准备','若何','出战','亲⾃','必有','⼀⼈','⼈⻢','不知','何⼈','此事','之中',
 '伏兵','祁⼭','乘势','忽⻅','⼤笑','樊城','兄弟','⾸级','立于','⻄川','传令','当先','五百','⼀彪','坚守',
 '此时','之间','投降','五千','埋伏','⻓安','三路','遣使','将军','关兴','军师','朝廷','三军','⼤王','回⻅',
 '⼤将军','必然','将⼠','是夜','⼩路' }

merges = [ ('刘备',('⽞德','⽞德⽈','⽞德问','刘⽞德','⽞德⼤','⽞德⾃','⽞德闻','皇叔','刘皇叔')),
    ('关⽻',('关公','云⻓','关云⻓')),
    ('孔明',('诸葛亮','孔明⽈','孔明笑','孔明之','孔明⾃')),
    ('曹操',('丞相','孟德','曹公','曹孟德')),
    ('张⻜',('翼德','张翼德'))]
    
def countWords(excludes, merges):
    txt = open('三国演义.txt', 'r', encoding = 'utf-8').read()
    words = jieba.lcut(txt)
    counts = {}
    # 取出⻓度为⼀的词和符号以及excludes中的词
    for word in words:
        if len(word) == 1 or word in excludes:
            continue
        else:
            counts[word] = counts.get(word, 0) + 1
 # 合并名称相同的⼈名
    for merge in merges:
        for name in merge[1]:
            counts[merge[0]] += counts.get(name, 0)
            del counts[name]
    word_list = list(counts.items())
    word_list.sort(key = lambda x : x[1], reverse = True)
    return word_list

word_list = countWords(excludes, merges)

for i in range(30):
    word, count = word_list[i]
    print(i+1, word, count)