import jieba
# 屏蔽词(即不参与统计)
excludes =  {'却说','二人','不可','怎么','两个','那怪','甚么','这个','不曾','不是','三个','出来','只是','真个',
            '有些','闻言','这里','进去','那个','乃是','袈裟','这般','铁棒','果然','就是','不要','小妖','如今','弟子','宝贝',
            '妇人','认得','观看','上前','起来','哥哥','行李','一个个','国王','金光','叫做','一座','晓得','不好','十分','取经',
            '师徒','他们','一把','听见','兵器','人家','性命','女婿','金星','神仙','扯住','云头','王子','问道','你们','所以',
            '童子','变化','看看','怎生','取出','员外','里面','故此','西方','也罢','西天','女儿','公主','妖魔','欢喜','吩咐',
            '一条','本事','不尽','金箍棒','慌得','口里','老儿','大仙','果子','看见','驸马','贫僧','人参果','进来','转身','还有',
            '罢了','拜佛','手段','大唐','多少','几个','忍不住','老魔道','高叫','抬头','赶上','洞口','降妖','回来','洞里','模样',
            '一场','天地','为证','一般','礼拜','儿子','女子','之下','出去','言语','叩头','走路','东土','叫声','唬得','老者','玉帝',
            '那些','方才','有个','不住','神通','地下','不题','空中','还是','一口','只有','下界','哪吒','二郎','放心','清风','老师',
            '造化','天上','报道','仔细','烦恼','明日','近前','一则','却是','毕竟','下回分解','四众','知道','坐在','做个','未曾',
            '看时','怪物','老爷','喝道','土地','老魔','厉声','说话','许多','只管','三日','常言道','现了','自家','驾云','门前',
            '大小','打死','衣服','七个','门外','收拾','有人','安排','祖师','老猪','一件','本相','这些','出门','孩儿','双手',
            '赌斗','老道','一根','明月','花果山','山中','跳出','此言','回头','不期','父母','三星','此间','一顿','门首','一遍',
            '一只','不须','便是','且莫','打个','天宫','佛祖','一下','唐朝','祥云','耳朵','灵山','耍子','中间','过来','修行',
            '走出','孽畜','计较','拿来','一时','白马','拿出','肚里','一路','佛衣','四个','当年','老高','问讯','魔头','小王子',
            '那道士','即命','真是','下来','列位','人间','好处','半空','仙童','两边','磕头','黄花','天晚','迎接','受用','一定',
            '没有','那长老','东西','方便','无礼','身子','公主道','相貌','父子','回去','跪下','面前','法师','放在','过去','底下',
            '仙气','不了','夯货','坐下','五庄观','战兢兢','惊动','须臾','一会','众猴','有缘','将身','洞天','听说','朝上','将来',
            '洞门','慈悲','可怜','马匹','就要','求经','三位','孩子','有何','在家','解了','其实','不用','不必','不成','房里','早已',
            '黄袍','五百年','按落','大哥','大惊道','何处','殿下','咒语','烧火','黑汉','天兵','众僧','吃斋','旁边','瑞气','不过',
            '太子','不吃','害怕','老怪','三老','无方','二来','金击子','那老儿','长嘴','心惊','龙王','九头','那厮','阴阳','大海',
            '树上','一块','直至','此处','福地','水帘洞','日月','不识','为何','不觉','不会','的话','你家','没奈何','一个','那里',
            '我们','不知','只见','原来','正是','不得','如何' }
# 同义词(即人物别名算作其正名来统计)
merges =  [  ('孙悟空',('孙行者','齐天大圣','大圣','孙长老','孙大圣','悟空','行者','老孙','猴王')),
        ('猪八戒',('猪悟能','八戒')),
        ('沙僧',('沙和尚','师弟')),
        ('唐僧',('唐三藏','唐长老','金蝉子','三藏'))]
# 定义词频统计函数(传入屏蔽词和同义词)
def countWords(excludes, merges):
    # 读取文章txt文件
    txt = open('西游记.txt', 'r', encoding = 'utf-8').read()
    words = jieba.lcut(txt)
    counts = {} # 通过键值对的形式存储词语及其出现的次数
    # 取出⻓度为⼀的词和符号以及excludes中的词
    for word in words:
        if len(word) == 1 or word in excludes:
            continue
        else:
            counts[word] = counts.get(word, 0) + 1
    # 合并名称相同的⼈名
    for merge in merges:
        for name in merge[1]:
            counts[merge[0]] += counts.get(name, 0)
            del counts[name]
    word_list = list(counts.items())# 将键值对转换成列表
    word_list.sort(key = lambda x : x[1], reverse = True) # 根据词语出现的次数进行从大到小排序
    return word_list
word_list = countWords(excludes, merges)
for i in range(100):
    word, count = word_list[i]
    print(i+1, word, count)
